app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-05-01 21:55:02.466548"], ["updated_at", "2017-05-01 21:55:02.466548"]]
---
	def create
 	 @school_class = SchoolClass.new(schoolclass_params(:title, :room_number))
 	 @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2017-05-01 22:00:43.145084"], ["id", 1]]
---
	def update
 		@school_class = SchoolClass.find(params[:id])
  		@school_class.update(schoolclass_params(:title))